<template>
  <div>
    <swiper class="swiper" :options="swiperOption">
      <swiper-slide class="text">
        <div>
          北京时间4月17日，据美媒报道，前NBA球员理查德-杰弗森表示，如果现在对阵的是休斯顿火箭，金州勇士早已以0-2落后。如果连路易斯-威廉姆斯和帕特里克-贝弗利都能给勇士制造麻烦的话，对上“灯泡组合”又会咋样？
          广告
          昨天，勇士成为NBA季后赛史上首支单场领先31分却遭翻盘的球队。勇士和快船，最豪华阵容对决最平民阵容的这一轮系列赛，目前竟战成1-1平局。更令勇士揪心的，是他们还在昨天折损了德马库斯-考辛斯，后者可能就此和今年季后赛说再见。
          昨天赛后，这场比赛也成为NBA的热门谈资，老将杰弗森在做客知名记者扎克-洛维的播客节目时，也没有避开这一热门话题。
          “如今勇士根本就没打出他们需要打出的那种表现，”杰弗森直言，“倘若他们现在对阵的是火箭，那勇士早就已经以0-2落后了。”
          杰弗森接着说：“如果勇士认为是路威痛扁了他们，并认为连贝弗利都能给他们制造麻烦的话，那么如果下一轮遇到詹姆斯-哈登和克里斯-保罗，又会发生什么……去年西决勇士曾以2-3落后火箭，若非保罗伤停，我相信即使是勇士死忠也都会认为那轮系列赛将难如登天。”
          接下来这轮系列赛将移师洛杉矶斯台普斯球馆进行，后天G3就将开打，勇士做好绝地反击的准备了吗？（魑魅）
          北京时间4月17日，据美媒报道，前NBA球员理查德-杰弗森表示，如果现在对阵的是休斯顿火箭，金州勇士早已以0-2落后。如果连路易斯-威廉姆斯和帕特里克-贝弗利都能给勇士制造麻烦的话，对上“灯泡组合”又会咋样？
          广告
          昨天，勇士成为NBA季后赛史上首支单场领先31分却遭翻盘的球队。勇士和快船，最豪华阵容对决最平民阵容的这一轮系列赛，目前竟战成1-1平局。更令勇士揪心的，是他们还在昨天折损了德马库斯-考辛斯，后者可能就此和今年季后赛说再见。
          昨天赛后，这场比赛也成为NBA的热门谈资，老将杰弗森在做客知名记者扎克-洛维的播客节目时，也没有避开这一热门话题。
          “如今勇士根本就没打出他们需要打出的那种表现，”杰弗森直言，“倘若他们现在对阵的是火箭，那勇士早就已经以0-2落后了。”
          杰弗森接着说：“如果勇士认为是路威痛扁了他们，并认为连贝弗利都能给他们制造麻烦的话，那么如果下一轮遇到詹姆斯-哈登和克里斯-保罗，又会发生什么……去年西决勇士曾以2-3落后火箭，若非保罗伤停，我相信即使是勇士死忠也都会认为那轮系列赛将难如登天。”
          接下来这轮系列赛将移师洛杉矶斯台普斯球馆进行，后天G3就将开打，勇士做好绝地反击的准备了吗？（魑魅）
        </div>
      </swiper-slide>
    </swiper>
  </div>
</template>

<script>
import "swiper/dist/css/swiper.css";

import { swiper, swiperSlide } from "vue-awesome-swiper";
export default {
  components: {
    swiper,
    swiperSlide
  },
  data() {
    return {
      slide: [1, 2, 3, 4],
      swiperOption: {
          direction: 'vertical',
          slidesPerView: 'auto',
          freeMode: true,
          mousewheel: true
        }
    };
  }
};
</script>

<style  scoped>
  .swiper{
    height: 400px;
    overflow: hidde;;
  }
  .text{
    font-size: 12px;
    text-align: left;
    padding: 30px;
    height: auto;
    box-sizing: border-box;
  }
</style>